Процедура ПриЗаписи(Отказ)
	
	Если ЗначениеЗаполнено(Курьер) Тогда
		
		КурьерОбъект = Курьер.ПолучитьОбъект();
		
		Если СтатусЗаказа = Перечисления.СтатусыЗаказов.Доставлен Тогда
			КурьерОбъект.СтатусДоступности = Перечисления.СтатусыКурьеров.Свободен;
		ИначеЕсли СтатусЗаказа <> Перечисления.СтатусыЗаказов.Отменен Тогда
			КурьерОбъект.СтатусДоступности = Перечисления.СтатусыКурьеров.Занят;
		КонецЕсли;
		
		КурьерОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры    
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() И Не ЗначениеЗаполнено(ДатаВремяСозданияЗаказа) Тогда
		ДатаВремяСозданияЗаказа = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры